app/views/teclado/estudar_teclado.html.erb

SELECT `teclas`.* FROM `teclas` WHERE `teclas`.`teclado_id` = 48
---
			<ul>
				<% @teclado.teclas.each do |tecla| %>

SELECT `caracteres`.* FROM `caracteres` WHERE `caracteres`.`tecla_id` = 1
---

								<% tecla.caracteres.each do |caractere| %>