app/views/teclado/visualizar_tecla.html.erb

			<ul>
				<% for i in 0..@tecla.caracteres.length-1 do %>
---
SELECT `caracteres`.* FROM `caracteres` WHERE `caracteres`.`tecla_id` = 4

			<ul>
				<% @teclado.teclas.each do |tecla| %>
---
SELECT `teclas`.* FROM `teclas` WHERE `teclas`.`teclado_id` = 1