app/controllers/teclado_controller.rb

  def estudar_teclado
     @teclado = Teclado.new
    @teclado = Teclado.first
---
SELECT `teclados`.* FROM `teclados` LIMIT 1

  def visualizar_tecla
    @teclado = Teclado.new
    @teclado = Teclado.first

    @tecla = Tecla.find(params[:format]);
---
SELECT `teclados`.* FROM `teclados` LIMIT 1
SELECT `teclas`.* FROM `teclas` WHERE `teclas`.`teclado_id` = 1